flow-over-plate/buoyantSimpleFoam-aster/Fluid/constant/turbulenceProperties
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      turbulenceProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

simulationType  laminar;

RAS
{
	RASModel	kEpsilon;
	turbulence	off;
	printCoeffs on;
}

// ************************************************************************* //
